//SAGJCL   PROC  PROG=ADARUN,      PROGRAM=ADARUN/XDCCALL
//             REGIO=1M,           REGION SIZE
//             DBID=<dbid>,        DATABASE ID
//             LLIB='V81.LOAD',    MVSLOAD
//*
//SAG      EXEC  PGM=&PROG,REGION=&REGIO
//STEPLIB  DD  DSN=ADABAS.&LLIB,DISP=SHR
//DDASSOR1 DD  DSN=ADABAS.DB&DBID..ASSOR1,DISP=SHR
//DDDATAR1 DD  DSN=ADABAS.DB&DBID..DATAR1,DISP=SHR
//DDWORKR1 DD  DSN=ADABAS.DB&DBID..WORKR1,DISP=SHR
//DDDRUCK  DD  SYSOUT=*
//DDPRINT  DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//XDCCDF   DD  DUMMY
//SYSOUT   DD  SYSOUT=*
//DDCARD   DD  DSN=ADABAS.JOBS(RUNPARM),DISP=SHR
//         DD  DDNAME=RUNPARM

